app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`username`, `password`, `level`, `updated_at`, `created_at`) values ('jaja', 'yi6EiJdyJ3ZlP.f7QxrIz.s1OiW1QD/ljKSAuZbosETMClwm6CwQK', '0', '2017-07-06 18:19:08', '2017-07-06 18:19:08')
---
    protected function create(array $data)
    {
        return User::create([
            'username' => $data['username'],
            'password' => bcrypt($data['password']),
            'level' => '1',
        ]);