app/Http/Controllers/catesController.php

insert into `cates` (`name`, `tbn`, `description`, `updated_at`, `created_at`) values ('bu con cú', 'bu con cú', 'bu con cú', '2017-07-03 19:10:24', '2017-07-03 19:10:24')
---
    public function store(Request $request)
    {
        $this->validate($request ,[
            'name' => 'required|unique:cates,name'
        ],[
            'name.required' => 'Cần phải điền cate vào !',
            'name.unique' => 'Cate đã có người dùng !'
        ]);
        $cates = new catesModel;
        $cates->name = $request->name;
        $cates->tbn = $request->name;
        $cates->description = $request->name;
        $cates->save();

delete from `cates` where `id` = '12'
---
    public function destroy($id)
    {
        $cates = catesModel::find($id);
        $cates->delete();