app/Http/Controllers/confsController.php

    public function store(Request $request)
    {
        $confs = new confsModel;
        $confs->content = $request->content;
        $confs->level = 0;
        $confs->user_id = $request->user_id;
        $confs->save();
---
insert into `confs` (`content`, `level`, `user_id`, `updated_at`, `created_at`) values ('<p>Trừ Văn và Sinh được 7,25 điểm, các môn thi còn lại của Phương Liên đều từ 9 trở lên, trong đó Toán, Lý, Hóa giành điểm tuyệt đối.&nbsp;</p>', '0', '3', '2017-07-08 17:41:01', '2017-07-08 17:41:01')