app/Http/Controllers/postsController.php

    public function store(postsRequests $request)
    {
        $img = $request->file('tbn');
        $imgname = $img->getClientOriginalName();
        $upload = 'public/upload/imgsUpload';
        $img->move($upload,$imgname);

        //Upload file img
        $posts = new postsModel;
        $posts->title = $request->txtTitle;
        $posts->tbn = $imgname;
        $posts->description = $request->txtDesc;
        $posts->content = $request->txtContent;
        $posts->level = 0;
        $posts->cate_id = $request->cate_id;
        $posts->user_id = $request->user_id;
        $posts->save();
---
insert into `posts` (`title`, `tbn`, `description`, `content`, `level`, `cate_id`, `user_id`, `updated_at`, `created_at`) values ('Lắp đặt 4 camera Quan sát HD giá chỉ từ 4,000,000...', 'IMG00018.JPG', '$(\".edit\").show();\r\n		$(\".post\").hide();\r\n		$(\"#myModal\").modal(\'show\');', '<p>$(&quot;.edit&quot;).show();<br />\r\n&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;$(&quot;.post&quot;).hide();<br />\r\n&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;$(&quot;#myModal&quot;).modal(&#39;show&#39;);</p>', '0', '25', '3', '2017-07-06 18:10:45', '2017-07-06 18:10:45')

    public function check(Request $request,$id){
        $posts = postsModel::find($id);
        $posts->level = $request->level;
        $posts->edit_admin = $request->user_id;
        $posts->update();
---
update `posts` set `level` = '1', `edit_admin` = '3', `updated_at` = '2017-07-08 17:43:42' where `id` = '6'

    public function view($id){
        $posts = postsModel::find($id);
        $view = [
            "title" => $posts->title,
            "tbn" => $posts->tbn,
            "description" => $posts->description,
            "content" => $posts->content,
            "username" => $posts->user->username,
            "updated_at" => $posts->updated_at,
---
update `posts` set `level` = '1', `updated_at` = '2017-07-08 17:45:04' where `id` = '5'