app/Http/Controllers/usersController.php

    public function index()
    {
        $users = User::orderBy('id','DESC')->get();
---
select * from `users` order by `id` desc

    public function show($id)
    {
        $user = User::find($id)->posts()->get();
---
select * from `posts` where `posts`.`user_id` = '3' and `posts`.`user_id` is not null
select * from `users` where `users`.`id` = '3' limit 1

    public function update(Request $request, $id)
    {
        $users = User::find($id);
---
select * from `users` where `users`.`id` = '3' limit 1

    public function destroy($id)
    {
        $users = User::find($id);
        $users->delete();
---
select * from `users` where `users`.`id` = '1' limit 1
delete from `users` where `id` = '1'